<?php
include './connect.php';

$areas = ["臺北市", "新北市", "桃園市", "臺中市", "臺南市", "高雄市", "新竹縣", "苗栗縣", "彰化縣", "南投縣", "雲林縣", "嘉義縣", "屏東縣", "宜蘭縣", "花蓮縣", "臺東縣", "澎湖縣", "金門縣", "連江縣", "基隆市", "新竹市", "嘉義市"];
$lasts = ["何", "傅", "劉", "吳", "呂", "周", "唐", "孫", "宋", "張", "彭", "徐", "於", "曹", "曾", "朱", "李", "林", "梁", "楊", "沈", "王", "程", "羅", "胡", "董", "蕭", "袁", "許", "謝", "趙", "郭", "鄧", "鄭", "陳", "韓", "馬", "馮", "高", "黃"];
$names = ['李秀娥', '陳勝花', '楊啟香', '陳雅淳', '李梅苓', '鄭志宏', '闕茂忠', '劉科亞', '夏俊逸', '邱宏偉', '陳佳隆', '吳宜博', '陳依潔', '朱山華', '邱璇佳', '張振瑋', '陳冠淑', '楊佳齊', '仇明珠', '周鈺雯', '陳小偉', '陳少隆', '阮靜宜', '林家來', '鄧蘭珮', '夏金維', '張聿新', '林依婷', '陳淑敏', '陳欣治', '陳怡君', '馮玟瑜', '林泰秋', '王怡君', '賴成茜', '涂盈君', '陳昇邦', '王詩琬', '林雅慧', '宋致茹', '李宛政', '李玉婷', '楊宜君', '黃友亞', '王玉玲', '張書豪', '蔡培平', '柯夢軍', '王文彥', '林振瑋', '李雅婷', '李振法', '沈辰甫', '林婉政', '謝宜純', '楊欣潔', '林怡紫', '賴梅琬', '傅佳紫', '郭名賢', '余秀吟', '林惠宣', '蔡儒仰', '涂詩枝', '蔡可念', '李虹韻', '鄭惠旺', '邱均函', '余馨智', '林雅郁', '陳詩涵', '黃凱鈞', '林佑諭', '謝柏成', '林軍書', '林冠霖', '王南慈', '林語麟', '陳秀修', '郭怡君', '陳雅霖', '黃家瑜', '謝駿昌', '陳佳靜', '馮士哲', '家沛達', '李真元', '丁青山', '黃淑惠', '林奕皓', '王彥廷', '張哲雅', '張舜茜', '郭政宏', '敖芸岳', '陳晴映', '郭麗卿', '潘雅婷', '賴雪志', '徐韻如', '孫欣怡', '謝明欣', '陳雅竹', '蔡嘉杰', '吳沛然', '許志昀', '李雅芬', '林偉智', '李俊傑', '楊方坤', '林怡年', '黃瓊芬', '林典亮', '林宗妮', '吳玲一', '陳韻婷', '李淑航', '賴清盈', '張俊傑', '陳彥宏', '李佳韋', '陳淑真', '林冠俐', '黃竣貴', '侯惠玲', '陳季康', '賴明哲', '黃奇惠', '吳俊弘', '吳明憲', '楊宜靜', '白浩淳', '林美雲', '廖家菱', '鐘伶睿', '李佩如', '張雅妏', '張南燕', '程逸群', '蔡依仁', '陳仰賢', '陳冠宇', '吳惠恆', '高佩芬', '楊堯屏', '簡為亦', '張雅萍', '戴奎玉', '張陽佩', '黃耀月', '陳孟綸', '謝佩陽', '李思妃', '朱光雨', '劉珮君', '陳維倫', '黃欣樺', '宋惠珠', '夏兆天', '吳嘉慧', '錢俊穎', '張瑋泰', '雷伯臻', '陳樂彬', '陳淑婷', '李雅嵐', '江佳和', '陳瑩英', '李婉芬', '張文海', '郭玉鳳', '駱景城', '何民銘', '洪怡樺', '黃姿伶', '李璇忠', '林婉珍', '陳合鈺', '張冰慈', '曾有雪', '陳慶伶', '莊雅英', '李詩涵', '馮晴育', '林志成', '陳恩泰', '林育亞', '陳怡芬', '李怡虹', '李睿維', '陳國恭', '蔡宛音', '陳家榮', '郭志宏', '楊淑芬', '黃俊嘉', '林佳剛', '楊靖彬', '鄭育德'];
$photo = ['spyfather', 'spymother', 'spyanya'];
$password = '0000';

$sql = "INSERT INTO `member_info`(
        `account`, 
        `password`, 
        `name`, 
        `nickname`, 
        `mobile`,
        `birthday`,
        `level`,
        `creat_at`,
        `photo`
    ) VALUES (
        ?,
        ?,
        ?,
        ?,
        ?,
        ?,
        ?,
        NOW(),
        ?
    )";

$stmt = $pdo->prepare($sql);

for ($i = 0; $i < 200; $i++) {
    shuffle($names);
    shuffle($lasts);
    shuffle($areas);
    $name = $names[0];
    $letters = '';
    for ($j = 0; $j < 3; $j++) {
        $letters .= chr(rand(97, 122)); // 產生 ASCII 碼在 97~122 之間的隨機整數，並轉換成對應的字元
    }
    $account = $letters . rand(10000, 99999) . '@gmail.com';
    $nickname = '小' . $lasts[0];
    $mobile = '09' . rand(10000000, 99999999);
    $t = rand(strtotime('1970-01-01'), strtotime('2000-01-01'));
    $birthday =  date('Y-m-d', $t);
    $level = 1;
    $p = rand(0, 2);

    $stmt->execute([
        $account,
        $password,
        $name,
        $nickname,
        $mobile,
        $birthday,
        $level,
        $photo[$p]
    ]);
}

echo json_encode([
    $stmt->rowCount(), // 影響的資料筆數
    $pdo->lastInsertId(), // 最新的新增資料的主鍵
]);
